#### Pandas - DataFrame and Series 

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures.
- A Series is one-Dimensional array- like object
- A DataFrame is a two-Dimensional, Size-Mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [37]:
import pandas as pd
data = ['apple',2,3,4,'Mango']
series = pd.Series(data)
print("Series:",series)
print(type(series))

Series: 0    apple
1        2
2        3
3        4
4    Mango
dtype: object
<class 'pandas.core.series.Series'>

In [17]:
## Create a series from dictionary 

data = {'apple':100,'Mango':200,'Guva':80,'Watermelon':25}
series = pd.Series(data)
print("Series:",series)
print(type(series))

Series: apple         100
Mango         200
Guva           80
Watermelon     25
dtype: int64
<class 'pandas.core.series.Series'>

In [18]:
data = [10,20,30,40] 
index = ['a','b','c','d']
series = pd.Series(data, index = index)
print(series)

a    10
b    20
c    30
d    40
dtype: int64

In [24]:
## Dataframe
## create a Dataframe from a dictionary of list

data = {

'Name':['Pradeep','Subbu','Nishith'],
'Age':[24,25,24],
'City':['Bangalore','Pune','Hyderabad']

}

df=pd.DataFrame(data)
print(df)
df

      Name  Age       City
0  Pradeep   24  Bangalore
1    Subbu   25       Pune
2  Nishith   24  Hyderabad

      Name  Age       City
0  Pradeep   24  Bangalore
1    Subbu   25       Pune
2  Nishith   24  Hyderabad

In [29]:
import numpy as np
print(np.array(df))
np.shape(df)

[['Pradeep' 24 'Bangalore']
 ['Subbu' 25 'Pune']
 ['Nishith' 24 'Hyderabad']]

(3, 3)

In [32]:
# Creating DataFrame from list of dictionarys

data = [
    {'Name':'Pradeep','Age':24,'City':'Bangalore'},
    {'Name':'subbu','Age':26,'City':'pune'},
    {'Name':'Nishith','Age':24,'City':'Hyderabad'},
]
df = pd.DataFrame(data)
df

      Name  Age       City
0  Pradeep   24  Bangalore
1    subbu   26       pune
2  Nishith   24  Hyderabad

In [43]:
## Accessing data from csv file 
df=pd.read_csv('Sales_Data.csv') 
df.head(5) # Displaying the first 5 rows of the data
df.tail(5) # Displaying the last 5 rows of the data

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
185945,13617,222905,AAA Batteries (4-pack),1,2.99,2019-06-07 19:02:00,"795 Pine St, Boston, MA 02215",6,2.99,Boston,19
185946,13618,222906,27in FHD Monitor,1,149.99,2019-06-01 19:29:00,"495 North St, New York City, NY 10001",6,149.99,New York City,19
185947,13619,222907,USB-C Charging Cable,1,11.95,2019-06-22 18:57:00,"319 Ridge St, San Francisco, CA 94016",6,11.95,San Francisco,18
185948,13620,222908,USB-C Charging Cable,1,11.95,2019-06-26 18:35:00,"916 Main St, San Francisco, CA 94016",6,11.95,San Francisco,18
185949,13621,222909,AAA Batteries (4-pack),1,2.99,2019-06-25 14:33:00,"209 11th St, Atlanta, GA 30301",6,2.99,Atlanta,14